tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Debugger for the Go programming language
brew "delve"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua", link: false
# Package manager for the Lua programming language
brew "luarocks"
# Open source relational database management system
brew "mysql"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql@14"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Terminal multiplexer
brew "tmux"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "font-hack-nerd-font"
# Free and open-source media player
cask "iina"
# GPU-based terminal emulator
cask "nimble-commander"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Docker
brew "docker"          
brew "docker-compose" 
brew "docker-machine"
brew "ctr"          
brew "docker-ce-cli"
